results/cpu-vs-latency2/redis/7-2/nsl206.out
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  30 secs]  0 threads:      600016 ops,   20294 (avg:   20000) ops/sec, 771.23KB/sec (avg: 759.94KB/sec),  0.29 (avg:  0.30) msec latency

3         Threads
2         Connections per thread
30        Seconds
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets        1818.30          ---          ---      0.29700       140.08
Gets       18182.20         9.77     18172.43      0.29500       619.86
Totals     20000.49         9.77     18172.43      0.29500       759.94


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET        -nan    100.00000
---
GET       0.063      0.00018
GET       0.064      0.00055
GET       0.065      0.00092
GET       0.066      0.00110
GET       0.067      0.00128
GET       0.068      0.00165
GET       0.069      0.00183
GET       0.070      0.00202
GET       0.071      0.00238
GET       0.073      0.00275
GET       0.074      0.00293
GET       0.076      0.00312
GET       0.077      0.00348
GET       0.078      0.00422
GET       0.079      0.00495
GET       0.080      0.00513
GET       0.081      0.00550
GET       0.082      0.00587
GET       0.083      0.00697
GET       0.084      0.00825
GET       0.085      0.00935
GET       0.086      0.01118
GET       0.087      0.01302
GET       0.088      0.01485
GET       0.089      0.01778
GET       0.090      0.02053
GET       0.091      0.02347
GET       0.092      0.02695
GET       0.093      0.03612
GET       0.094      0.05885
GET       0.095      0.07260
GET       0.096      0.07956
GET       0.097      0.08470
GET       0.098      0.08855
GET       0.099      0.09056
GET       0.100      0.10156
GET       0.110      0.11990
GET       0.120      0.13970
GET       0.130      0.19800
GET       0.140      0.39526
GET       0.150      0.64165
GET       0.160      0.87888
GET       0.170      1.15681
GET       0.180      1.69433
GET       0.190      3.16719
GET       0.200      6.53917
GET       0.210     12.08341
GET       0.220     16.99975
GET       0.230     19.93448
GET       0.240     21.15160
GET       0.250     22.05010
GET       0.260     22.85308
GET       0.270     24.12575
GET       0.280     26.83040
GET       0.290     32.16565
GET       0.300     42.02674
GET       0.310     55.24587
GET       0.320     69.62878
GET       0.330     81.84436
GET       0.340     90.26064
GET       0.350     94.89392
GET       0.360     97.29974
GET       0.370     98.50513
GET       0.380     99.10994
GET       0.390     99.41390
GET       0.400     99.56441
GET       0.410     99.65296
GET       0.420     99.70044
GET       0.430     99.72537
GET       0.440     99.74554
GET       0.450     99.76002
GET       0.460     99.77359
GET       0.470     99.79485
GET       0.480     99.82180
GET       0.490     99.85169
GET       0.500     99.88047
GET       0.510     99.90815
GET       0.520     99.93125
GET       0.530     99.95307
GET       0.540     99.96828
GET       0.550     99.97928
GET       0.560     99.98698
GET       0.570     99.99285
GET       0.580     99.99432
GET       0.590     99.99633
GET       0.600     99.99780
GET       0.610     99.99835
GET       0.620     99.99853
GET       0.670     99.99872
GET       0.700     99.99890
GET       0.730     99.99908
GET       1.200     99.99945
GET       1.300    100.00000